alpha_1.25/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/




FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hill
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1068;
        startFace       61082;
    }
    top-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          452;
        startFace       62150;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          30626;
        startFace       62602;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          30626;
        startFace       93228;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          47;
        startFace       123854;
        matchTolerance  9.999999747e-05;
        transform       translational;
        neighbourPatch  cyclicAMI_inlet;
        separationVector ( -11.25 0 0 );
        lowWeightCorrection 0.009999999776;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          50;
        startFace       123901;
        matchTolerance  9.999999747e-05;
        transform       translational;
        neighbourPatch  cyclicAMI_outlet;
        separationVector ( 11.25 0 0 );
        lowWeightCorrection 0.009999999776;
    }
)

// ************************************************************************* //
